using Microsoft.EntityFrameworkCore;
using OSI.Core.Helpers;
using OSI.Core.Models.Db;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Xunit;

namespace OSI.Core.Tests
{
    public class TestRusNumber
    {
        [Theory]
        [InlineData(1, "один тенге 00 тиын")]
        [InlineData(11, "одиннадцать тенге 00 тиын")]
        [InlineData(12, "двенадцать тенге 00 тиын")]
        [InlineData(1000, "одна тысяча тенге 00 тиын")]
        [InlineData(4000, "четыре тысячи тенге 00 тиын")]
        [InlineData(11000, "одиннадцать тысяч тенге 00 тиын")]
        [InlineData(12000, "двенадцать тысяч тенге 00 тиын")]
        [InlineData(14000, "четырнадцать тысяч тенге 00 тиын")]
        [InlineData(4014501, "четыре миллиона четырнадцать тысяч пятьсот один тенге 00 тиын")]
        [InlineData(11011011, "одиннадцать миллионов одиннадцать тысяч одиннадцать тенге 00 тиын")]
        [InlineData(12012012, "двенадцать миллионов двенадцать тысяч двенадцать тенге 00 тиын")]
        [InlineData(1.01, "один тенге 01 тиын")]
        [InlineData(11.01, "одиннадцать тенге 01 тиын")]
        [InlineData(12.01, "двенадцать тенге 01 тиын")]
        [InlineData(1000.01, "одна тысяча тенге 01 тиын")]
        [InlineData(4000.01, "четыре тысячи тенге 01 тиын")]
        [InlineData(11000.01, "одиннадцать тысяч тенге 01 тиын")]
        [InlineData(12000.01, "двенадцать тысяч тенге 01 тиын")]
        [InlineData(14000.01, "четырнадцать тысяч тенге 01 тиын")]
        [InlineData(4014501.01, "четыре миллиона четырнадцать тысяч пятьсот один тенге 01 тиын")]
        [InlineData(11011011.01, "одиннадцать миллионов одиннадцать тысяч одиннадцать тенге 01 тиын")]
        [InlineData(12012012.01, "двенадцать миллионов двенадцать тысяч двенадцать тенге 01 тиын")]
        [InlineData(12012000.01, "двенадцать миллионов двенадцать тысяч тенге 01 тиын")]
        [InlineData(12000000.01, "двенадцать миллионов тенге 01 тиын")]
        [InlineData(-1, "минус один тенге 00 тиын")]
        [InlineData(-11, "минус одиннадцать тенге 00 тиын")]
        [InlineData(-12, "минус двенадцать тенге 00 тиын")]
        [InlineData(-1000, "минус одна тысяча тенге 00 тиын")]
        [InlineData(-4000, "минус четыре тысячи тенге 00 тиын")]
        [InlineData(-11000, "минус одиннадцать тысяч тенге 00 тиын")]
        [InlineData(-12000, "минус двенадцать тысяч тенге 00 тиын")]
        [InlineData(-14000, "минус четырнадцать тысяч тенге 00 тиын")]
        [InlineData(-4014501, "минус четыре миллиона четырнадцать тысяч пятьсот один тенге 00 тиын")]
        [InlineData(-11011011, "минус одиннадцать миллионов одиннадцать тысяч одиннадцать тенге 00 тиын")]
        [InlineData(-12012012, "минус двенадцать миллионов двенадцать тысяч двенадцать тенге 00 тиын")]
        [InlineData(-1.01, "минус один тенге 01 тиын")]
        [InlineData(-11.01, "минус одиннадцать тенге 01 тиын")]
        [InlineData(-12.01, "минус двенадцать тенге 01 тиын")]
        [InlineData(-1000.01, "минус одна тысяча тенге 01 тиын")]
        [InlineData(-4000.01, "минус четыре тысячи тенге 01 тиын")]
        [InlineData(-11000.01, "минус одиннадцать тысяч тенге 01 тиын")]
        [InlineData(-12000.01, "минус двенадцать тысяч тенге 01 тиын")]
        [InlineData(-14000.01, "минус четырнадцать тысяч тенге 01 тиын")]
        [InlineData(-4014501.01, "минус четыре миллиона четырнадцать тысяч пятьсот один тенге 01 тиын")]
        [InlineData(-11011011.01, "минус одиннадцать миллионов одиннадцать тысяч одиннадцать тенге 01 тиын")]
        [InlineData(-12012012.01, "минус двенадцать миллионов двенадцать тысяч двенадцать тенге 01 тиын")]
        [InlineData(-12012000.01, "минус двенадцать миллионов двенадцать тысяч тенге 01 тиын")]
        [InlineData(-12000000.01, "минус двенадцать миллионов тенге 01 тиын")]
        public void TestRusSpelledOut(decimal d, string expected)
        {
            Assert.Equal(expected, d.RusSpelledOut(true, true));
        }
    }
}
